%--------------------初始模型---------------------------%
num = 1.05;den = [conv(conv([0.125 ,1] ,[0.5 ,1]) ,[1 ,1 ,1])];
num1 = 1.05 * [0.4762 ,1];den1 = [conv(conv([0.125 ,1] ,[0.5 ,1]) ,[1 ,1 ,1])];
num2 = 1.05 * [1 ,1];den2 = [conv(conv([0.125 ,1] ,[0.5 ,1]) ,[1 ,1 ,1])];
num3 = 1.05 * [0.4762 ,1];den3 = [conv(conv([0.25 ,1] ,[0.5 ,1]) ,[1 ,1 ,1])];
num4 = 1.05 * [0.4762 ,1];den4 = [conv([0.5 ,1] ,[1 ,1 ,1])];
num5 = 1.05;den5 = [1 ,1 ,1];
%--------------------初始模型---------------------------%

sys1 = tf(num ,den);
sys2 = tf(num1 ,den1);
sys3 = tf(num2 ,den2);
sys4 = tf(num3 ,den3);
sys5 = tf(num4 ,den4);
sys6 = tf(num5 ,den5);

[z ,p ,k] = tf2zp(num ,den);
[z1 ,p1 ,k1] = tf2zp(num1 ,den1);
[z2 ,p2 ,k2] = tf2zp(num2 ,den2);
[z3 ,p3 ,k3] = tf2zp(num3 ,den3);
[z4 ,p4 ,k4] = tf2zp(num4 ,den4);
[z5 ,p5 ,k5] = tf2zp(num5 ,den5);

sys7 = zpk(z ,p ,k);
sys8 = zpk(z1 ,p1 ,k1);
sys9 = zpk(z2 ,p2 ,k2);
sys10 = zpk(z3 ,p3 ,k3);
sys11 = zpk(z4 ,p4 ,k4);
sys12 = zpk(z5 ,p5 ,k5);
%----------------------模型---------------------------%
% [z ,p ,k] = tf2zp(num1 ,den);
% sys1 = zpk([] ,p ,k);
% sys2 = zpk(z ,p ,k);
% sys3 = tf(1.05*[1,1] ,den);
% p4 = p;p4(1) = -4;
% sys4 = zpk(z ,p4 ,k);
% p4(1) = [];
% sys5 = zpk(z ,p4 ,k);
% p4(2) = [];
% sys6 = zpk([] ,p4 ,k);
% sys6 = tf(1.05 ,[1,1,1]);
%-----获取参数--------%
t = 0 : 0.01 : 13;
[y1 ,x1] = step(sys1 ,t);[y2 ,x2] = step(sys2 ,t);[y3 ,x3] = step(sys3 ,t);
[y4 ,x4] = step(sys4 ,t);[y5 ,x5] = step(sys5 ,t);[y6 ,x6] = step(sys6 ,t);
%-----获取参数--------%

%------分析动态性能指标-------%
A = analysis(y1 ,x1 ,t);
B = analysis(y2 ,x2 ,t);
C = analysis(y3 ,x3 ,t);
D = analysis(y4 ,x4 ,t);
E = analysis(y5 ,x5 ,t);
F = analysis(y6 ,x6 ,t);
%-----分析动态性能指标--------%

%----------------画图---------------%
t = 0 : 0.01 : 13;
figure(1);
step(sys1 ,'r' ,...
    sys2 ,'b' ,...
    sys3 ,'g',...
    sys4 ,'c' ,...
    sys5 ,'m' ,...
    sys6 ,'y' ,t);
legend('1.z=0,p=-8,-2',...
    '2.z=-2.1,p=-8,-2',...
    '3.z=-1,p=-8,-2',...
    '4.z=-2.1,p=-1,-2',...
    '5.z=-2.1,p=-2',...
    '6.z=0,p=0');
%----------------画图---------------%
%----------------标注---------------%
% gtext('1.z=0,p=-8,-2');
% gtext('2.z=-2.1,p=-8,-2');
% gtext('3.z=-1,p=-8,-2');
% gtext('4.z=-2.1,p=-1,-2');
% gtext('5.z=-2.1,p=-2');
% gtext('6.z=0,p=0');
%----------------标注---------------%
%----------------------模型---------------------------%

%----------------------表格---------------------------%
disp('notice: tr:上升时间 tp:峰值时间  ts：调节时间   pos:超调量');
name = {'1' ;'2';'3';'4';'5';'6'};
tr = [A(1) ;B(1) ;C(1) ;D(1) ;E(1) ;F(1)];
tp = [A(2) ;B(2) ;C(2) ;D(2) ;E(2) ;F(2)];
ts = [A(3) ;B(3) ;C(3) ;D(3) ;E(3) ;F(3)];
pos = [A(4) ;B(4) ;C(4) ;D(4) ;E(4) ;F(4)];
table(tr ,tp ,pos ,ts ,'RowNames',name)
%----------------------表格---------------------------%
