%--------------------初始模型---------------------------%
num = 1.05 * [0.4762 ,1];den = [conv(conv([0.125 ,1] ,[0.5 ,1]) ,[1 ,1 ,1])];
%--------------------初始模型---------------------------%

%----------------------模型---------------------------%
[z ,p ,k] = tf2zp(num ,den);
sys1 = zpk([] ,p ,k);
sys2 = zpk(z ,p ,k);
sys3 = zpk(-1,p ,k);
p4 = p;p4(1) = -4;
sys4 = zpk(z ,p4 ,k);
p4(1) = [];
[num ,den] = zp2tf(z ,p4 ,k);
sys5 = tf(num ,den);
p4(2) = [];
[num ,den] = zp2tf([] ,p4 ,k);
sys6 = tf(num ,den);
%-----获取参数--------%
t = 0 : 0.01 : 12;
[y1 ,x1] = step(sys1 ,t);[y2 ,x2] = step(sys2 ,t);[y3 ,x3] = step(sys3 ,t);
[y4 ,x4] = step(sys4 ,t);[y5 ,x5] = step(sys5 ,t);[y6 ,x6] = step(sys6 ,t);
%-----获取参数--------%

%------分析动态性能指标-------%
A = analysis(y1 ,x1 ,t);
B = analysis(y2 ,x2 ,t);
C = analysis(y3 ,x3 ,t);
D = analysis(y4 ,x4 ,t);
E = analysis(y5 ,x5 ,t);
F = analysis(y6 ,x6 ,t);
%-----分析动态性能指标--------%

%----------------画图---------------%
t = 0 : 0.01 : 12;
figure(1);
step(sys1 ,'r' ,...
    sys2 ,'b' ,...
    sys3 ,'g',...
    sys4 ,'c' ,...
    sys5 ,'m' ,...
    sys6 ,'y' ,t);
legend('1','2','3','4','5','6');
%----------------画图---------------%
%----------------------模型---------------------------%

%----------------------表格---------------------------%
disp('notice: tr:上升时间 tp:峰值时间  ts：调节时间   pos:超调量');
name = {'1' ;'2';'3';'4';'5';'6'};
tr = [A(1) ;B(1) ;C(1) ;D(1) ;E(1) ;F(1)];
tp = [A(2) ;B(2) ;C(2) ;D(2) ;E(2) ;F(2)];
ts = [A(3) ;B(3) ;C(3) ;D(3) ;E(3) ;F(3)];
pos = [A(4) ;B(4) ;C(3) ;D(4) ;E(4) ;F(4)];
table(tr ,tp ,ts ,pos ,'RowNames',name)
%----------------------表格---------------------------%
