%----------------------原模型---------------------------%
num = 1.05 * [0.4762 ,1];den = [conv(conv([0.125 ,1] ,[0.5 ,1]) ,[1 ,1 ,1])];
%----------------------原模型---------------------------%

%--------------------零极点形式-------------------------%
[z ,p ,k] = tf2zp(num ,den);
sys = zpk(z ,p ,k)

figure(1);                          
pzmap(sys);                             %生成零极点分布图
%--------------------零极点形式-------------------------%

%------------绘制四阶、二阶单位阶跃响应-------------------%
num2 = 1.05;den2 = [1 ,1 ,1];               %近似二阶系统
sys2 = tf(num2 ,den2);
figure(2);
t = 0 : 0.01 : 12;
step(sys ,'r-' ,...
    sys2 ,'g--' ,t);
legend('原四阶系统','近似二阶系统');
%---------------分析动态性能指标-------------------------%
[x ,y] = step(sys ,t);
A = analysis(x ,y ,t);
[x2 ,y2] = step(sys2 ,t);
B = analysis(x2 ,y2 ,t);
%---------------分析动态性能指标-------------------------%
%---------------     列表      -------------------------%
disp('notice: tr:上升时间 tp:峰值时间  ts：调节时间   pos:超调量');
name = {'四阶系统' ;'二阶系统'};
tr = [A(1) ;B(1)];
tp = [A(2) ;B(2)];
ts = [A(3) ;B(3)];
pos = [A(4) ;B(4)];
table(tr ,tp ,ts ,pos ,'RowNames',name)
%---------------     列表      -------------------------%
%------------绘制四阶、二阶单位阶跃响应-------------------%